In [14]:
# Importing the library
import pandas as pd
import numpy as np

In [3]:
# Series -- It is a one dimensional labeled array capable of holding data of any type
marks = pd.Series([25, 52, 72, 45, 33])
marks # By default indexing starts from zero, and dtype is object

0    25
1    52
2    72
3    45
4    33
dtype: int64

In [4]:
data = {
    'a': 25,
    'b': 33,
    'c': 75,
    'd': 95
}
data

{'a': 25, 'b': 33, 'c': 75, 'd': 95}

In [5]:
data = pd.Series(data)
data

a    25
b    33
c    75
d    95
dtype: int64

In [6]:
dt = np.arange(10, 100, 10, dtype = 'f4')
s = pd.Series(dt, index = np.arange(11, 20))
s

11    10.0
12    20.0
13    30.0
14    40.0
15    50.0
16    60.0
17    70.0
18    80.0
19    90.0
dtype: float32

In [7]:
l = [[13, 16, 19], [56, 59, 63]]
s = pd.Series(l)
s

0    [13, 16, 19]
1    [56, 59, 63]
dtype: object

In [43]:
# dictionary
dt1 = {
        "Name": ['a', 'b', 'c'],
        'Class': ['x', 'y', 'z']
}
dt1

{'Class': ['x', 'y', 'z'], 'Name': ['a', 'b', 'c']}

In [21]:
# Pandas dataframe -- two dimensional data structure
df = pd.DataFrame(dt1)
df['Marks'] = [10, 40, 50]
df

  Class Name  Marks
0     x    a     10
1     y    b     40
2     z    c     50

In [39]:
# Passing in the list of lists
x = np.arange(10, 35, 5)
list1 = np.array([np.array([10, 20, 30, 40, 50]), x])
df1 = pd.DataFrame(list1)
df1

    0   1   2   3   4
0  10  20  30  40  50
1  10  15  20  25  30

In [70]:
x1 = np.arange(5, 30, 5)
y1 = x1*x1 + 5
arr = np.array([x1, y1])
df_xy = pd.DataFrame(np.transpose(arr), columns = ['x', 'y'])
df_xy['Sum'] = df_xy['x'] + df_xy['y']
df_xy

    x    y  Sum
0   5   30   35
1  10  105  115
2  15  230  245
3  20  405  425
4  25  630  655